mbed-ce/mbed-os/connectivity/drivers/emac/TARGET_STM/STM32EthIPv2DMARings.cpp
/* Copyright (c) 2024 Jamie Smith
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "STM32EthIPv2DMARings.h"

#include "ThisThread.h"
#include "mbed_trace.h"

#define TRACE_GROUP  "CEMAC"

namespace mbed {

// Thread flag constants
static uint32_t THREAD_FLAG_TX_DESC_AVAILABLE = 1;
static uint32_t THREAD_FLAG_RX_DESC_AVAILABLE = 2;
static uint32_t THREAD_FLAG_SHUTDOWN = 4;

// Event flag constants
static uint32_t EVENT_FLAG_TX_DESC_AVAILABLE = 1;

void STM32EthIPv2DMARings::buildRxDescriptors() {

    // Note: With this Ethernet peripheral, you can never give back every single descriptor to
    // the hardware, because then it thinks there are 0 descriptors left.
    while (rxDescsOwnedByApplication > 1) {
        auto &currRxDesc = rxDescs[rxBuildIndex];

        // Allocate new buffer
        auto *const buffer = memory_manager.alloc_pool(rxPoolPayloadSize, RX_BUFFER_ALIGN);
        if (buffer == nullptr) {
            // No memory, cannot return any more descriptors.
            return;
        }

        // Clear out any bits previously set in the descriptor
        memset(&currRxDesc.rxDesc.toDMAFmt, 0, sizeof(EthRxDescriptor));

        // Store buffer address
        currRxDesc.buffer = buffer;
        currRxDesc.rxDesc.toDMAFmt.buffer1Addr = memory_manager.get_ptr(buffer);

        // Configure descriptor
        currRxDesc.rxDesc.toDMAFmt.buffer1Valid = true;
        currRxDesc.rxDesc.toDMAFmt.buffer2Valid = false;
        currRxDesc.rxDesc.toDMAFmt.intrOnCompletion = true;
        currRxDesc.rxDesc.toDMAFmt.dmaOwn = true;

#if __DCACHE_PRESENT
        // Flush to main memory
        SCB_CleanDCache_by_Addr(&currRxDesc, __SCB_DCACHE_LINE_SIZE);
#endif

        // Move to next descriptor
        --rxDescsOwnedByApplication;
        rxBuildIndex = (rxBuildIndex + 1) % rxPoolSize;

        // Update tail ptr to issue "rx poll demand" and mark this descriptor for receive.
        // Rx stops when the current and tail pointers are equal, so we want to set the tail pointer
        // to one location after the last DMA-owned descriptor in the FIFO.
        heth.Instance->DMACRDTPR = reinterpret_cast<uint32_t>(&rxDescs[rxBuildIndex]);
    }
}

// TODO monitor for Rx buffer exhaustion conditions.  This happens when we have too few
// built Rx buffers and won't be able to receive another packet.  Example: if the size of
// one buffer is 512 bytes, then we need at least 3 built buffers to be able to receive
// the next packet if it's 1 MTU.
// If we are in a potential buffer exhaustion situation, we need to poll at a reasonably
// high rate (10ms) until the application has freed up at least some of the pool buffers.
// NOTE: In LwIP, the failed allocation of a buffer from the pool will trigger a cleanup
// of the TCP reassembly buffer, potentially freeing some memory in the near future.

net_stack_mem_buf_t *STM32EthIPv2DMARings::rxNextPacket() {
    // Indices of the first and last descriptors for the packet will be saved here
    size_t firstDescIdx = rxPoolSize;
    size_t lastDescIdx = rxPoolSize;

    // Prevent looping around into descriptors waiting for rebuild by limiting how many
    // we can process.
    const size_t maxDescsToProcess = rxPoolSize - rxDescsOwnedByApplication;

    const size_t startIdx = rxNextIndex;

    for (size_t descCount = 0; descCount < maxDescsToProcess && lastDescIdx == rxPoolSize; descCount++) {
        size_t descIdx = (startIdx + descCount) % rxPoolSize;
        auto &descriptor = rxDescs[descIdx];

#if __DCACHE_PRESENT
        SCB_InvalidateDCache_by_Addr(&descriptor, sizeof(EthRxDescriptor));
#endif

        if (descriptor.rxDesc.fromDMAFmt.dmaOwn) {
            // Descriptor owned by DMA and has not been filled in yet.  We are out of descriptors to process.
            break;
        }

        if (descriptor.rxDesc.fromDMAFmt.context || descriptor.rxDesc.fromDMAFmt.errorSummary) {
            // Context or error descriptor.  Ignore, free associated memory, and schedule for rebuild.
            memory_manager.free(descriptor.buffer);
            ++rxDescsOwnedByApplication;
            ++rxNextIndex;

            // We should only get one of these descriptors before the start of the packet, not
            // during it.
            MBED_ASSERT(firstDescIdx == rxPoolSize);

            continue;
        }

        if (descriptor.rxDesc.fromDMAFmt.firstDescriptor) {
            // We should see first descriptor only once and before last descriptor. If this rule is violated, it's
            // because we ran out of descriptors during receive earlier and the MAC tossed out the rest of the packet.
            if(firstDescIdx != rxPoolSize) {
                // Clean up the old first descriptor
                auto & oldFirstDesc = rxDescs[firstDescIdx];
                memory_manager.free(oldFirstDesc.buffer);
                ++rxDescsOwnedByApplication;
                ++rxNextIndex;
            }

            // We should not have seen any last descriptors yet
            MBED_ASSERT(lastDescIdx == rxPoolSize);

            firstDescIdx = descIdx;
        }

        if (descriptor.rxDesc.fromDMAFmt.lastDescriptor) {
            // We should see last descriptor only once and after first descriptor
            MBED_ASSERT(firstDescIdx != rxPoolSize);
            MBED_ASSERT(lastDescIdx == rxPoolSize);

            lastDescIdx = descIdx;
        }
    }

    if (lastDescIdx == rxPoolSize) {
        // No complete packet identified.
        // Take the chance to rebuild any available descriptors, then return.
        tr_debug("No complete packets in Rx descs\n");
        buildRxDescriptors();
        return nullptr;
    }

