mbed-ce/mbed-os/connectivity/drivers/emac/TARGET_STM/STM32EthIPv2DMARings.cpp
    // We will receive next into the descriptor after this one.
    // Update this now to tell the ISR to search for descriptors after lastDescIdx only.
    rxNextIndex = (lastDescIdx + 1) % rxPoolSize;

    // Set length of first buffer
    net_stack_mem_buf_t *const headBuffer = rxDescs[firstDescIdx].buffer;
    size_t lenRemaining = rxDescs[lastDescIdx].rxDesc.fromDMAFmt.pktLength;
    memory_manager.set_len(headBuffer, std::min(lenRemaining, rxPoolPayloadSize));
    lenRemaining -= std::min(lenRemaining, rxPoolPayloadSize);

    // Iterate through the subsequent descriptors in this packet and link the buffers
    // Note that this also transfers ownership of subsequent buffers to the first buffer,
    // so if the first buffer is deleted, the others will be as well.
    ++rxDescsOwnedByApplication; // for first buffer
    rxDescs[firstDescIdx].buffer = nullptr;
    for (size_t descIdx = (firstDescIdx + 1) % rxPoolSize;
         descIdx != (lastDescIdx + 1) % rxPoolSize;
         descIdx = (descIdx + 1) % rxPoolSize) {

        // We have to set the buffer length first before concatenating it to the chain
        memory_manager.set_len(rxDescs[descIdx].buffer, std::min(lenRemaining, rxPoolPayloadSize));
        lenRemaining -= std::min(lenRemaining, rxPoolPayloadSize);

        memory_manager.cat(headBuffer, rxDescs[descIdx].buffer);
        rxDescs[descIdx].buffer = nullptr;
        ++rxDescsOwnedByApplication;
    }

    // Invalidate cache for all data buffers, as these were written by the DMA to main memory
#if __DCACHE_PRESENT
    auto * bufToInvalidate = headBuffer;
    while(bufToInvalidate != nullptr)
    {
        SCB_InvalidateDCache_by_Addr(memory_manager.get_ptr(bufToInvalidate), rxPoolPayloadSize);
        bufToInvalidate = memory_manager.get_next(bufToInvalidate);
    }
#endif

    tr_info("Returning packet of length %lu, start %p from Rx descriptors %zu-%zu (%p-%p)\n",
           memory_manager.get_total_len(headBuffer), memory_manager.get_ptr(headBuffer), firstDescIdx, lastDescIdx,
           &rxDescs[firstDescIdx], &rxDescs[lastDescIdx]);

    // Rebuild descriptors if possible
    buildRxDescriptors();

    return headBuffer;
}

void STM32EthIPv2DMARings::reclaimTxDescs() {
    bool returnedAnyDescriptors = false;
    while (true)
    {
        if (txReclaimIndex == txSendIndex && txDescsOwnedByApplication > 0) {
            // If we have reached the Tx send index, we want to stop iterating as this is
            // the next descriptor that has not been populated by the application yet.
            // The only exception is if the Tx ring is completely full, in which case we want
            // to process the entire ring.  In the case where the Tx ring is full,
            // txDescsOwnedByApplication will be 0.
            // Note that txSendIndex and txDescsOwnedByApplication are updated in a critical
            // section so their values will always be in sync with each other.
            break;
        }

        auto &currDesc = txDescs[txReclaimIndex];

#if __DCACHE_PRESENT
        SCB_InvalidateDCache_by_Addr(&currDesc, sizeof(EthTxDescriptor));
#endif

        if (currDesc.txDesc.fromDMAFmt.dmaOwn) {
            // This desc is owned by the DMA, so we have reached the part of the ring buffer
            // that is still being transmitted.
            // Done for now!
            break;
        }

        // Free any buffers associated with the descriptor
        if (currDesc.packetFirstBuf != nullptr) {
            memory_manager.free(currDesc.packetFirstBuf);
        }

        // Update counters
        txReclaimIndex = (txReclaimIndex + 1) % MBED_CONF_STM32_EMAC_ETH_TXBUFNB;
        txDescsOwnedByApplication++;

        returnedAnyDescriptors = true;
    }

    if (returnedAnyDescriptors) {
        eventFlags.set(EVENT_FLAG_TX_DESC_AVAILABLE);
    }
}

void STM32EthIPv2DMARings::macThread()
{
    while(true)
    {
        // Wait for something to happen
        uint32_t flags = rtos::ThisThread::flags_wait_any(THREAD_FLAG_TX_DESC_AVAILABLE | THREAD_FLAG_SHUTDOWN | THREAD_FLAG_RX_DESC_AVAILABLE);
        if(flags & THREAD_FLAG_SHUTDOWN)
        {
            return;
        }
        if(flags & (THREAD_FLAG_RX_DESC_AVAILABLE | THREAD_FLAG_TX_DESC_AVAILABLE)) // TODO temp
        {
            // Receive any available packets.
            // Note that if the ISR was delayed, we might get multiple packets per ISR, so we need to loop.
            while(true)
            {
                auto * packet = rxNextPacket();
                if(!packet) {
                    break;
                }

                if(emac_link_input_cb)
                {
                    emac_link_input_cb(packet);
                }
                else
                {
                    memory_manager.free(packet);
                }
            }
        }
        if(flags & THREAD_FLAG_TX_DESC_AVAILABLE)
        {
            reclaimTxDescs();
        }
    }
}


STM32EthIPv2DMARings::STM32EthIPv2DMARings(EMACMemoryManager &memory_manager, ETH_HandleTypeDef & heth, EMAC::emac_link_input_cb_t emac_link_input_cb):
        memory_manager(memory_manager),
        heth(heth),
        emac_link_input_cb(emac_link_input_cb),
        thread(osPriorityHigh, MBED_CONF_STM32_EMAC_THREAD_STACKSIZE, nullptr, "stm32_emac_rx_thread"),
        rxPoolSize(memory_manager.get_pool_size() - RX_POOL_EXTRA_BUFFERS + 1), // + 1 because we have to always keep one descriptor owned by the application
        rxDescs(rxPoolSize),
        rxPoolPayloadSize(memory_manager.get_pool_alloc_unit(RX_BUFFER_ALIGN))
{
    // Make sure we have enough space in the pool for RX_POOL_EXTRA_BUFFERS plus a minimum of two descriptors
    MBED_ASSERT(memory_manager.get_pool_size() >= RX_POOL_EXTRA_BUFFERS + 2);
}

STM32EthIPv2DMARings::~STM32EthIPv2DMARings()
{
    if(thread.get_state() != rtos::Thread::Deleted)
    {
        thread.flags_set(THREAD_FLAG_SHUTDOWN);
        thread.join();
    }
}


HAL_StatusTypeDef STM32EthIPv2DMARings::startDMA()
{
    if (heth.gState == HAL_ETH_STATE_READY)
    {
        heth.gState = HAL_ETH_STATE_BUSY;

        // At the start, we own all the descriptors
        rxDescsOwnedByApplication = rxPoolSize;
        txDescsOwnedByApplication = MBED_CONF_STM32_EMAC_ETH_TXBUFNB;

