mbed-ce/mbed-os/connectivity/drivers/emac/TARGET_STM/STM32EthIPv2DMARings.cpp
        // Flush Tx queue
        heth.Instance->MTLTQOMR |= ETH_MTLTQOMR_FTQ;

        // Configure Rx buffer size.  Per the datasheet and HAL code, we need to round this down to
        // the nearest multiple of 4.
        size_t rxBufferSize = memory_manager.get_pool_alloc_unit(RX_BUFFER_ALIGN);
        rxBufferSize = (rxBufferSize / sizeof(uint32_t)) * sizeof(uint32_t);
        heth.Instance->DMACRCR |= rxBufferSize << ETH_DMACRCR_RBSZ_Pos;

        // Configure spacing between descriptors.  This will be different depending on
        // cache line sizes.
        // NOTE: Cast pointers to uint8_t so that the difference will be returned in bytes instead
        // of elements.
        const size_t rxSpacing = reinterpret_cast<uint8_t const *>(&rxDescs[1]) - reinterpret_cast<uint8_t const *>(&rxDescs[0]);

        // Check that spacing seems valid
#ifndef NDEBUG
        const size_t txSpacing = reinterpret_cast<uint8_t const *>(&txDescs[1]) - reinterpret_cast<uint8_t const *>(&txDescs[0]);
        MBED_ASSERT(rxSpacing == txSpacing);
        MBED_ASSERT(rxSpacing % sizeof(uint32_t) == 0);
#endif

        // The spacing bitfield is configured as the number of 32-bit words to skip between descriptors.
        // The descriptors have a default size of 16 bytes.
        const size_t wordsToSkip = (rxSpacing - 16) / sizeof(uint32_t);
        MBED_ASSERT(wordsToSkip <= 7);
        heth.Instance->DMACCR &= ~ETH_DMACCR_DSL_Msk;
        heth.Instance->DMACCR |= wordsToSkip << ETH_DMACCR_DSL_Pos;

        // Configure Rx descriptor ring
        heth.Instance->DMACRDRLR = rxPoolSize - 1; // Ring size
        heth.Instance->DMACRDLAR = reinterpret_cast<uint32_t>(&rxDescs[0]); // Ring base address
        heth.Instance->DMACRDTPR = reinterpret_cast<uint32_t>(&rxDescs[0]); // Next descriptor (tail) pointer

        buildRxDescriptors();

        // Configure Tx descriptor ring
        heth.Instance->DMACTDRLR = MBED_CONF_STM32_EMAC_ETH_TXBUFNB - 1; // Ring size
        heth.Instance->DMACTDLAR = reinterpret_cast<uint32_t>(&txDescs[0]); // Ring base address
        heth.Instance->DMACTDTPR = reinterpret_cast<uint32_t>(&txDescs[0]); // Next descriptor (tail) pointer

        // Enable Rx and Tx DMA.  NOTE: Typo in C++ headers, these should be called
        // "DMACTXCR" and "DMACRXCR"
        heth.Instance->DMACTCR |= ETH_DMACTCR_ST;
        heth.Instance->DMACRCR |= ETH_DMACRCR_SR;

        // Clear Tx and Rx process stopped flags
        heth.Instance->DMACSR = (ETH_DMACSR_TPS | ETH_DMACSR_RPS);

        // Start Rx thread
        thread.start(mbed::callback(this, &STM32EthIPv2DMARings::macThread));

        heth.gState = HAL_ETH_STATE_STARTED;

        return HAL_OK;
    }
    else
    {
        return HAL_ERROR;
    }
}

void STM32EthIPv2DMARings::rxISR()
{
    // First, we need to check if at least one DMA descriptor that is owned by the application
    // has its last descriptor flag or error flag set, indicating we have received at least one complete packet
    // or there is an error descriptor that can be reclaimed by the application.
    // Note that we want to bias towards false positives here, because false positives just waste CPU time,
    // while false negatives would cause packets to be dropped.
    // So, for simplicity, we just check every descriptor currently owned by the application until we
    // find one with the FS bit set or the error bits set.
    // This could potentially produce a false positive if we do this in the middle of receiving
    // an existing packet, but that is unlikely and will not cause anything bad to happen if it does.

    for(size_t descCount = 0; descCount < rxPoolSize; descCount++)
    {
        auto &descriptor = rxDescs[rxNextIndex];

#if __DCACHE_PRESENT
        SCB_InvalidateDCache_by_Addr(&descriptor, sizeof(ETH_DMADescTypeDef));
#endif

        if (descriptor.rxDesc.fromDMAFmt.dmaOwn)
        {
            // Descriptor owned by DMA.  We are out of descriptors to process.
            return;
        }
        if (descriptor.rxDesc.fromDMAFmt.context || descriptor.rxDesc.fromDMAFmt.errorSummary || descriptor.rxDesc.fromDMAFmt.lastDescriptor)
        {
            // Reclaimable descriptor or complete packet detected.
            thread.flags_set(THREAD_FLAG_RX_DESC_AVAILABLE);
            return;
        }
    }
}

void STM32EthIPv2DMARings::txISR()
{
    thread.flags_set(THREAD_FLAG_TX_DESC_AVAILABLE);
}

HAL_StatusTypeDef STM32EthIPv2DMARings::txPacket(net_stack_mem_buf_t * buf)
{
    // Step 1: Figure out if we can send this zero-copy, or if we need to copy it.
    // Also note that each descriptor can store 2 buffers, so we need half as many descriptors
    // as we have buffers, rounding up.
    size_t neededDescs = (memory_manager.count_buffers(buf) + 1) / 2;
    bool needToCopy = false;
    if(neededDescs > MBED_CONF_STM32_EMAC_ETH_TXBUFNB)
    {
        // Packet uses too many buffers, we have to copy it into a continuous buffer.
        needToCopy = true;
    }

    if(!needToCopy)
    {
        net_stack_mem_buf_t * currBuf = buf;
        while(currBuf != nullptr)
        {
            // If this buffer is passed down direct from the application, we will need to
            // copy the packet.
            if(memory_manager.get_lifetime(currBuf) == NetStackMemoryManager::Lifetime::VOLATILE)
            {
                needToCopy = true;
            }

            // On STM32H7, the Ethernet DMA cannot access data in DTCM.  So, if someone sends
            // a packet with a data pointer in DTCM (e.g. a stack allocated payload), everything
            // will break if we don't copy it first.
#ifdef MBED_RAM_BANK_SRAM_DTC_START
            if(reinterpret_cast<ptrdiff_t>(memory_manager.get_ptr(currBuf)) >= MBED_RAM_BANK_SRAM_DTC_START &&
                reinterpret_cast<ptrdiff_t>(memory_manager.get_ptr(currBuf)) <= MBED_RAM_BANK_SRAM_DTC_START + MBED_RAM_BANK_SRAM_DTC_SIZE)
            {
                needToCopy = true;
            }
#endif

