mbed-ce/mbed-os/connectivity/drivers/emac/TARGET_STM/STM32EthIPv2DMARings.cpp
            currBuf = memory_manager.get_next(currBuf);
        }
    }

    printf("Transmitting packet of length %lu in %zu buffers and %zu descs\n",
           memory_manager.get_total_len(buf), memory_manager.count_buffers(buf), neededDescs);

    // Step 2: Copy packet if needed
    if(needToCopy)
    {
        auto * newBuf = memory_manager.alloc_heap(memory_manager.get_total_len(buf), 0);
        if(newBuf == nullptr)
        {
            // No free memory, drop packet
            memory_manager.free(newBuf);
            return HAL_ERROR;
        }

        // We should have gotten just one contiguous buffer
        MBED_ASSERT(memory_manager.get_next(newBuf) == nullptr);
        neededDescs = 1;

        // Copy data over
        memory_manager.copy_from_buf(memory_manager.get_ptr(newBuf), memory_manager.get_len(newBuf), buf);
        memory_manager.free(buf);
        buf = newBuf;
    }

    // Step 3: Wait for needed amount of buffers to be available.
    // Note that, in my experience, it's better to block here, as dropping the packet
    // due to not having enough buffers can create weird effects when the application sends
    // lots of packets at once.
    while(txDescsOwnedByApplication < neededDescs)
    {
        eventFlags.wait_any_for(EVENT_FLAG_TX_DESC_AVAILABLE, rtos::Kernel::wait_for_u32_forever);
    }

    // Step 4: Load buffer into descriptors and send
    net_stack_mem_buf_t * currBuf = buf;
    for(size_t descCount = 0; descCount < neededDescs; descCount++)
    {
        auto & currDesc = txDescs[txSendIndex];

        // Set buffer 1
        currDesc.txDesc.toDMAFmt.buffer1Addr = static_cast<uint8_t *>(memory_manager.get_ptr(currBuf));
        currDesc.txDesc.toDMAFmt.buffer1Len = memory_manager.get_len(currBuf);

        // Set buffer 2
        currBuf = memory_manager.get_next(currBuf);
        if(currBuf != nullptr)
        {
            currDesc.txDesc.toDMAFmt.buffer2Addr = memory_manager.get_ptr(currBuf);
            currDesc.txDesc.toDMAFmt.buffer2Len = memory_manager.get_len(currBuf);

            // Move to next buffer
            currBuf = memory_manager.get_next(currBuf);
        }
        else
        {
            currDesc.txDesc.toDMAFmt.buffer2Addr = nullptr;
            currDesc.txDesc.toDMAFmt.buffer2Len = 0;
        }

        if(currBuf == nullptr)
        {
            // Last descriptor, store buffer address for freeing
            currDesc.packetFirstBuf = buf;
        }
        else
        {
            currDesc.packetFirstBuf = nullptr;
        }

//        printf("Tx Ethernet buffer:");
//        for(size_t byteIdx = 0; byteIdx < currDesc.txDesc.toDMAFmt.buffer1Len; ++byteIdx)
//        {
//            printf(" %02" PRIx8, reinterpret_cast<uint8_t const *>(currDesc.txDesc.toDMAFmt.buffer1Addr)[byteIdx]);
//        }
//        printf("\n");
//
//        printf("Tx Ethernet buffer2:");
//        for(size_t byteIdx = 0; byteIdx < currDesc.txDesc.toDMAFmt.buffer2Len; ++byteIdx)
//        {
//            printf(" %02" PRIx8, reinterpret_cast<uint8_t const *>(currDesc.txDesc.toDMAFmt.buffer2Addr)[byteIdx]);
//        }
//        printf("\n");

#if __DCACHE_PRESENT
        // Write buffers back to main memory
        SCB_CleanDCache_by_Addr(const_cast<void*>(currDesc.txDesc.toDMAFmt.buffer1Addr), currDesc.txDesc.toDMAFmt.buffer1Len);
        if(currDesc.txDesc.toDMAFmt.buffer2Addr != nullptr)
        {
            SCB_CleanDCache_by_Addr(const_cast<void*>(currDesc.txDesc.toDMAFmt.buffer2Addr), currDesc.txDesc.toDMAFmt.buffer2Len);
        }
#endif

        // Enter a critical section, because we could run into weird corner cases if the
        // interrupt executes while we are half done configuring this descriptor and updating
        // the counters.
        core_util_critical_section_enter();

        // Configure settings.  Note that we have to configure these every time as
        // they get wiped away when the DMA gives back the descriptor
        currDesc.txDesc.toDMAFmt._reserved = 0;
        currDesc.txDesc.toDMAFmt.checksumInsertionCtrl = 0; // Mbed does not do checksum offload for now
        currDesc.txDesc.toDMAFmt.tcpSegmentationEnable = false; // No TCP offload
        currDesc.txDesc.toDMAFmt.tcpUDPHeaderLen = 0; // No TCP offload
        currDesc.txDesc.toDMAFmt.srcMACInsertionCtrl = 0; // No MAC insertion
        currDesc.txDesc.toDMAFmt.crcPadCtrl = 0; // Insert CRC and padding
        currDesc.txDesc.toDMAFmt.lastDescriptor = currBuf == nullptr;
        currDesc.txDesc.toDMAFmt.firstDescriptor = descCount == 0;
        currDesc.txDesc.toDMAFmt.isContext = false;
        currDesc.txDesc.toDMAFmt.vlanTagCtrl = 0; // No VLAN tag
        currDesc.txDesc.toDMAFmt.intrOnCompletion = true;
        currDesc.txDesc.toDMAFmt.timestampEnable = false;
        currDesc.txDesc.toDMAFmt.dmaOwn = true;

#if __DCACHE_PRESENT
        // Write descriptor back to main memory
        SCB_CleanDCache_by_Addr(&currDesc, sizeof(EthTxDescriptor));
#endif

        // Update descriptor count and index
        txDescsOwnedByApplication--;
        txSendIndex = (txSendIndex + 1) % MBED_CONF_STM32_EMAC_ETH_TXBUFNB;

        core_util_critical_section_exit();

        // Move tail pointer register to point to the descriptor after this descriptor.
        // This tells the MAC to transmit until it reaches the given descriptor, then stop.
        heth.Instance->DMACTDTPR = reinterpret_cast<uint32_t>(&txDescs[txSendIndex]);
    }

    return HAL_OK;
}

}